---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilySelfOrienting
source: html/04170127-33b4-e598-b0b1-4a8b45db22e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilySelfOrienting Property

"Align to View"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilySelfOrienting { get; }
```